
#include"stdlib.h"
#include"windows.h"
#include<iostream>
#include"hanshu.h"
using namespace std;

int main() 
{
    cout << "------------------------------------------------------------" << endl;
	cout << "**********************************************************" << endl;
	cout << "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^" << endl;
	cout << "       面向对象程序设计c++第二次上机作业！！！" << endl;
	cout << "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^" << endl;
	cout << "**********************************************************" << endl;
	cout << "------------------------------------------------------------" << endl;
	first();
	cout << endl << endl;
	second();
	cout << endl << endl;
	third();
	cout << endl << endl;


}